src/soap/online_checkout/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="tns:ns">
    <soapenv:Header>
        <tns:CheckOutHeader>
            <MERCHANT_ID>OC_PAYBILL</MERCHANT_ID>
            <PASSWORD>OC_PASSWORD</PASSWORD>
            <TIMESTAMP>OC_TIMESTAMP</TIMESTAMP>
        </tns:CheckOutHeader>
    </soapenv:Header>
    <soapenv:Body>
        <tns:processCheckOutRequest>
            <MERCHANT_TRANSACTION_ID>OC_TRANS_ID</MERCHANT_TRANSACTION_ID>
            <TRX_ID>OC_TRANS_ID</TRX_ID>
            <REFERENCE_ID>OC_REF_ID</REFERENCE_ID>
            <AMOUNT>OC_AMOUNT</AMOUNT>
            <MSISDN>OC_NUMBER</MSISDN>
            <ENC_PARAMS></ENC_PARAMS>
            <CALL_BACK_URL>OC_CALL_URL</CALL_BACK_URL>
            <CALL_BACK_METHOD>OC_CALL_METHOD</CALL_BACK_METHOD>
            <TIMESTAMP>OC_TIMESTAMP</TIMESTAMP>
        </tns:processCheckOutRequest>
    </soapenv:Body>
</soapenv:Envelope>