resources/transactionStatusQuery.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="tns:ns">
    <soapenv:Header>
        <tns:CheckOutHeader>
            <MERCHANT_ID>{{MerchantID}}</MERCHANT_ID>
            <PASSWORD>{{Password}}</PASSWORD>
            <TIMESTAMP>?</TIMESTAMP>
        </tns:CheckOutHeader>
    </soapenv:Header>
    <soapenv:Body>
        <tns:transactionStatusRequest>
            <!--Optional:-->
            <TRX_ID>?</TRX_ID>
            <!--Optional:-->
            <MERCHANT_TRANSACTION_ID>?</MERCHANT_TRANSACTION_ID>
        </tns:transactionStatusRequest>
    </soapenv:Body>
</soapenv:Envelope>